<template>
  <v-container>
    <center>
      <h1 class="intro-heading">Cross-Origin Resource Sharing</h1>
      <br />
      <!-- <p>
        В днешно време повечето сайтове (особено тези,
        генериращи високи доходи - дали чрез привличане на клиентела или онлайн
        продажби) са съставени от Front end -->
      <!-- (софтуер, изграждащ потребителския -->
      <!-- интерфейс)  -->
      <!-- и Back end. В уеб програмирането тези термини означават следното: -->
      <!-- (софтуер, инструктиращ сървъра как да -->
      <!-- обработва/предоставя данните или командите, постъпващи от Front end-a). -->
      <!-- </p> -->
      <!-- <p>
        Front end-ът е софтуер, инструктиращ браузърите как трябва да изглежда
        потребителския интерфейс
      </p> -->
      <p>
        &nbsp;Този проект има за цел да служи като учебно пособие по темата
        <b>Cross-Origin Resource Sharing</b> за студенти, бъдещи уеб
        програмисти, pentester-и и ентусиасти.
      </p>
      <p>
        &nbsp;С нарастващата нужда от 24 ч. наличност на онлайн услуги в днешно
        време, повечето сървъри имат нужда от възможността за изграждане на
        сигурни канали за комуникация с различни 'дестинации'. Легитимни причини
        за нуждата от CORS са: един или множество Front end-ове да могат да
        комуникират с един или множество Back end-ове, инкорпориране на шрифтове
        от
        <i>https://fonts.google.com</i>, позволяване на Google Analytics или
        MixPanel да събира аналитични данни за сайта ни, осъществяване на достъп
        до алгоритмите на reCAPTCHA за борба срещу автоматизирани действия и
        т.н.
      </p>
      <p>
        &nbsp;Препоръчително е да се запознаете с термините в
        <router-link to="/vocabulary">речника</router-link> преди да преминете
        към
        <router-link to="/main-doc">същността</router-link>
      </p>
    </center>
  </v-container>
</template>

<script>
export default {
  components: {},
};
</script>

<style scoped>
.intro-heading {
  margin: 30px 0px;
  border-top: 6px solid black;
  border-bottom: 6px solid black;
  width: fit-content;
  font-size: 3em;
  letter-spacing: 1px;
}
</style>