<template>
  <article>
    <h2>Типове CORS заявки</h2>
    <p>
      Има два типа CORS заявки: „прости“ (simple) и „пред полетни/
      предварителни/ прифлайт“ (preflight). Браузърът преценява кой тип заявка
      да използва. Полезно е програмистът да знае как браузърът взима това
      решение с цел оптимизация на производителността на натоварено уеб
      приложение, тъй като предварителните заявки са последвани от основните.
    </p>
    <br />
    <h3>Прости CORS заявки</h3>
    <p>
      Браузърът счита заявката за "проста", когато тя отговаря на определен
      набор от изисквания:
    </p>
    <ul>
      <li>
        Един от използваните методи е <code>GET</code>, <code>POST</code> или
        <code>HEAD</code>.
      </li>
      <li>
        <a href="https://fetch.spec.whatwg.org/#cors-safelisted-request-header"
          >CORS safe-listed</a
        >
        заглавка се използва.
      </li>
      <li>
        Когато се модифицира заглавката Content-Type, са разрешени само следните
        стойности: <code>application/x-www-form-urlencoded</code>,
        <code>multipart/form-data</code> или <code>text/plain</code>.
      </li>
      <li>
        Не са регистрирани event listeners (слушатели на събития) в нито един
        <code>XMLHttpRequestUpload</code> обект
      </li>
      <li>Не се използва <code>ReadableStream</code> обект в заявката</li>
    </ul>
    <br />
    <h3>Предварителни заявки</h3>
    <p>
      Ако дадена заявка не отговаря на критериите за проста заявка, браузърът
      вместо това ще направи автоматична предварителна заявка с помощта на
      OPTIONS метода. Това повикване се прави с цел установяване на точните CORS
      възможности на сървъра, което от своя страна се използва за определяне
      дали предвиденият CORS протокол е разбран или не. Ако резултатът от
      извикването на OPTIONS диктува, че заявката не може да бъде направена,
      действителната заявка към сървъра няма да бъде изпълнена.
    </p>
  </article>
</template>

<script>
export default {};
</script>

<style>
</style>