<template>
  <article>
    <h2>Cross-Site Request Forgery</h2>
    <p>
      <b>Cross-Site Request Forgery</b> ( <b>CSRF</b> / <b>XSRF</b> /
      <b>Hostile Linking</b> / <b>Session Riding</b> ) е кибер атака, която
      принуждава краен потребител незнайно да изпълни нежелани действия в уеб
      приложение, в което е оторизиран и/или е записана чувствителна информация.
    </p>
    <p>
      CSRF скрипта наследява самоличността и привилегиите на жертвата, за да
      изпълнява нежелана функция от името на жертвата. За повечето сайтове
      заявките на браузъра автоматично включват всички идентификационни данни
      като бисквитка на сесията на потребителя, IP адрес, идентификационни данни
      за домейн на Windows и т.н. Следователно, ако потребителят в момента е
      удостоверен за сайта, сайтът няма да има начин да направи разграничение
      между фалшивата и легитимната заявка, изпратена от жертвата.
    </p>
    <p>
      CSRF атаките са насочени към функционалност, която причинява промяна на
      състоянието на сървъра, като например промяна на имейл адреса или паролата
      на жертвата или закупуване на нещо. Принуждаването на жертвата да извлече
      данни не е от полза за нападателя, защото нападателят не получава
      отговора, а жертвата. Като такива, CSRF атаките са насочени към заявки за
      промяна на данни в сървър.
    </p>
    <p>
      Нападателят може да използва CSRF, за да получи личните данни на жертвата
      чрез специална форма на атака, известна като CSRF за влизане. Нападателят
      принуждава неудостоверен потребител да влезе в акаунт, който атакуващият
      контролира. Ако жертвата не осъзнава това, тя може да добави лични данни -
      като информация за кредитна карта - към акаунта. След това нападателят
      може да влезе отново в акаунта, за да види тези данни, заедно с историята
      на активността на жертвата в уеб приложението.
    </p>
    <Figure
      :figureNum="csrf_figureNum"
      :imgData="csrf_figure"
      figureCaption="Диаграма на CSRF атака"
      altCaption="Диаграма на CSRF атака"
      maxWidthImg="600px"
    />
    <p>
      <a href="https://owasp.org/www-community/attacks/csrf" target="_blank"
        >Научи повече тук</a
      >
    </p>
  </article>
</template>

<script>
import Figure from "./FigureDialog.vue";

export default {
  components: { Figure },
  data() {
    return {
      csrf_figureNum: 10,
      csrf_figure: require("../../media/csrf.png"),
    };
  },
};
</script>

<style>
</style>