<template>
  <article>
    <h2>Cross-Site Request Forgery</h2>
    <p>
      <b>Cross-Site Request Forgery</b> ( <b>CSRF</b> / <b>XSRF</b> /
      <b>Hostile Linking</b> / <b>Session Riding</b> ) е кибер атака, която
      принуждава краен потребител незнайно да изпълни нежелани действия в уеб
      приложение, в което е оторизиран и/или е записана чувствителна информация.
    </p>
    <p>
      CSRF скрипта наследява самоличността и привилегиите на жертвата, за да
      изпраща заявка от името на жертвата. Заявките на браузъра към определен
      домейн автоматично включват идентификационни данни, използвани при
      работата с уеб услугите на съответния домейн (като бисквитки).
      Следователно, ако потребителят в момента е оторизиран в сайт , сайтът няма
      да има начин да направи разграничение между фалшивата (изпратена от чужд
      origin => cross-origin) и легитимната заявка, изпратена от жертвата.
    </p>
    <p>
      CSRF атаките са насочени към функционалност, която причинява промяна на
      състоянието на сървъра, като например промяна на имейл адреса или паролата
      на жертвата или закупуване на нещо. Принуждаването на жертвата да извлече
      данни не е от полза за нападателя, защото нападателят не получава
      отговора, а жертвата. Като такива, CSRF атаките са насочени към заявки за
      промяна на данни в сървър (фиг. {{ csrf_figureNum }}).
    </p>
    <p>
      <a href="https://owasp.org/www-community/attacks/csrf" target="_blank"
        >Научи повече тук ...</a
      >
    </p>
    <Figure
      :figureNum="csrf_figureNum"
      :imgData="csrf_figure"
      figureCaption="Диаграма на CSRF атака"
      altCaption="Диаграма на CSRF атака"
      maxWidthImg="600px"
    />
    <br />

    <br />
  </article>
</template>

<script>
import Figure from "./FigureDialog.vue";

export default {
  components: { Figure },
  data() {
    return {
      csrf_figureNum: 10,
      csrf_figure: require("../../media/csrf.png"),
    };
  },
};
</script>

<style>
</style>